NordicPlayground/nrf52-ble-multi-link-multi-role/ble_peripheral/main_solution.c
/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler},
        {BUTTON_2, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    leds_init();
    timers_init();

// ### ------------------ TASK 4: STEP 3 ------------------
// ### Create your timer by using app_timer_create(app_timer_id_t const * p_timer_id, 
// ###                                             app_timer_mode_t mode, 
// ###                                             app_timer_timeout_handler_t timeout_handler)
// ### The app_timer_id_t should point to the variable you created in step 1.
// ### The app_timer_mode should be APP_TIMER_MODE_REPEATED. 
// ### The timeout handler should point to the function you created in step 2
    uint32_t err_code = app_timer_create(&m_data_update_timer, APP_TIMER_MODE_REPEATED, data_update_callback);
    APP_ERROR_CHECK(err_code);
// ### ----------------------------------------------------


    // This function enables analysis of the RX time in the RTT log
    // This can be used to measure the impact of changing the PHY, by measuring the time of each packet over the air
    radio_analysis_enable();
	
    log_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    gatt_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
